app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def show
        @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("email", "phone", "title", "company", "sex", "notes", "created_at", "updated_at", "user_id", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        @contact = current_user.contacts.new(contact_params)
        if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "contacts" SET "sex" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["sex", "O"], ["updated_at", "2019-08-16 22:18:21.161115"], ["id", 23]]
---
    def update
        @contact = Contact.find(params[:id])
        # options for an update: update, update!, update_attributes, update_attributes!
        if @contact.update(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
        # show an edit form to update an existing contact object
        @contact = Contact.find(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 1]]
---
    def destroy
        # delete a contact
        # if we run a method and don't render or redirect, rails will render <name of method>
        @contact = Contact.find(params[:id])
        @contact.destroy