app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ZQYuxU_mBIGde4YHSPwLyw"], ["updated_at", "2019-08-02 21:56:14.169040"], ["id", 1]]